blog/40.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-10 Mon 23:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 5.2.4 Monitoring Machine Performance</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 5.2.4 Monitoring Machine Performance
<br />
<span class="subtitle">2025-03-10 Mon</span>
</h1>
<p>
Authors point out that simulation is useful not only for verifying
correctness but also for measuring performance. They show a way to
measure the number of stack operations in a computation. The
statistics can be printed by passing a message to the machine.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">modified make-new-machine</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((pc (make-register 'pc))
        (flag (make-register 'flag))
        (stack (make-stack))
        (the-instruction-sequence '()))
    (<span style="color: #531ab6;">let</span> ((the-ops
           (list (list 'initialize-stack
                       (<span style="color: #531ab6;">lambda</span> () (stack 'initialize)))
                 (list 'print-stack-statistics
                       (<span style="color: #531ab6;">lambda</span> () (stack 'print-statistics)))))
          (register-table
           (list (list 'pc pc) (list 'flag flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (assoc name register-table)
            (error <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (set! register-table
                  (cons (list name (make-register name))
                        register-table)))
        'register-allocated)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((val (assoc name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (cadr val)
              (error <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((insts (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (null? insts)
              'done
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (car insts)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((eq? message 'start)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((eq? message 'install-instruction-sequence)
               (<span style="color: #531ab6;">lambda</span> (seq) (set! the-instruction-sequence seq)))
              ((eq? message 'allocate-register) allocate-register)
              ((eq? message 'get-register) lookup-register)
              ((eq? message 'install-operations)
               (<span style="color: #531ab6;">lambda</span> (ops) (set! the-ops (append the-ops ops))))
              ((eq? message 'stack) stack)
              ((eq? message 'operations) the-ops)
              (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))

<span style="color: #595959;">;; </span><span style="color: #595959;">new make-stack procedure</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-stack</span>)
  (<span style="color: #531ab6;">let</span> ((s '())
        (number-pushes 0)
        (max-depth 0)
        (current-depth 0))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">push</span> x)
      (set! s (cons x s))
      (set! number-pushes (+ 1 number-pushes))
      (set! current-depth (+ 1 current-depth))
      (set! max-depth (max current-depth max-depth)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">pop</span>)
      (<span style="color: #531ab6;">if</span> (null? s)
          (error <span style="color: #3548cf;">"Empty stack -- POP"</span>)
          (<span style="color: #531ab6;">let</span> ((top (car s)))
            (set! s (cdr s))
            (set! current-depth (- current-depth 1))
            top)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">initialize</span>)
      (set! s '())
      (set! number-pushes 0)
      (set! max-depth 0)
      (set! current-depth 0)
      'done)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">print-statistics</span>)
      (newline)
      (display (list 'total-pushes  '= number-pushes
                     'maximum-depth '= max-depth)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
      (<span style="color: #531ab6;">cond</span> ((eq? message 'push) push)
            ((eq? message 'pop) (pop))
            ((eq? message 'initialize) (initialize))
            ((eq? message 'print-statistics)
             (print-statistics))
            (<span style="color: #531ab6;">else</span>
             (error <span style="color: #3548cf;">"Unknown request -- STACK"</span> message))))
    dispatch))
</pre>
</div>
