blog/40.html
<div id="outline-container-orga578ca3" class="outline-2">
<h2 id="orga578ca3">Exercise 5.15</h2>
<div class="outline-text-2" id="text-orga578ca3">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Add counting "instruction counting" to the register machine
simulation.  That is, have the machine model keep track of the number
of instructions executed.  Extend the machine model's interface to
accept a new message that prints the value of the instruction count
and resets the count to zero.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">insts-counter</span> <span style="color: #0000b0;">0</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))
                 (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'print-stack-statistics</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'print-statistics</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (<span style="color: #531ab6;">set!</span> insts-counter (<span style="color: #8f0075;">+</span> insts-counter <span style="color: #0000b0;">1</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">print-and-reset-insts-counter</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
        (<span style="color: #8f0075;">display</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'insts-counter</span> <span style="color: #0000b0;">'=</span> insts-counter))
        (<span style="color: #531ab6;">set!</span> insts-counter <span style="color: #0000b0;">0</span>))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'print-insts-counter</span>) (print-and-reset-insts-counter)) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))
</pre>
</div>
</div>
</div>
