blog/40.html
<div id="outline-container-org42bd97c" class="outline-2">
<h2 id="org42bd97c">Exercise 5.16</h2>
<div class="outline-text-2" id="text-org42bd97c">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Augment the simulator to provide for "instruction tracing".  That is,
before each instruction is executed, the simulator should print the
text of the instruction.  Make the machine model accept `trace-on' and
`trace-off' messages to turn tracing on and off.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">trace-on</span> <span style="color: #8f0075;">false</span>)) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (<span style="color: #531ab6;">and</span> trace-on <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
                     (<span style="color: #531ab6;">begin</span>
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"Executed: "</span>)
                       (<span style="color: #8f0075;">display</span> (instruction-text (<span style="color: #8f0075;">car</span> insts)))
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'trace-on</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
               (<span style="color: #531ab6;">set!</span> trace-on <span style="color: #8f0075;">true</span>))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'trace-off</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;---</span>
               (<span style="color: #531ab6;">set!</span> trace-on <span style="color: #8f0075;">false</span>))
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))
</pre>
</div>
</div>
</div>
