blog/40.org
** Exercise 5.17
*Exercise*:

#+begin_quote
Extend the instruction tracing of Exercise 5.16 so that before
printing an instruction, the simulator prints any labels that
immediately precede that instruction in the controller sequence.  Be
careful to do this in a way that does not interfere with instruction
counting (Exercise 5.15).  You will have to make the simulator retain
the necessary label information.
#+end_quote

*Answer*:

I've modified the machine and the assembler so that the latter stores
the list of labels in the former. (Remember that a label is pair whose
car is the label name and whose cdr is a list of instructions).

Now, when we print the instruction text, we additionally check whether
such instruction is the cdr of one or more of the labels in the labels
list.

#+begin_src racket
  (define (assemble controller-text machine)
    (let ((result (extract-labels controller-text)))
      (let ((insts (car result)) (labels (cdr result)))
        (update-insts! insts labels machine)
        ((machine 'store-labels) labels)
        insts)))

  (define (make-new-machine)
    (let ((pc (make-register 'pc))
          (flag (make-register 'flag))
          (stack (make-stack))
          (the-instruction-sequence '())
          (labels-list '())
          (trace-on false))
      (let ((the-ops
             (list (list 'initialize-stack
                         (lambda () (stack 'initialize)))))
            (register-table
             (list (list 'pc pc) (list 'flag flag))))
        (define (allocate-register name)
          (if (assoc name register-table)
              (error "Multiply defined register: " name)
              (set! register-table
                    (cons (list name (make-register name))
                          register-table)))
          'register-allocated)
        (define (lookup-register name)
          (let ((val (assoc name register-table)))
            (if val
                (cadr val)
                (error "Unknown register:" name))))
        (define (execute)
          (let ((insts (get-contents pc)))
            (if (null? insts)
                'done
                (begin
                  ((instruction-execution-proc (car insts)))
                  (and trace-on
                       (begin
                         (display "Executing: ")
                         (display (instruction-text (car insts)))
                         (display "\n")
                         (display "Labels preceding it: ")
                         (for-each (lambda (label)
                                     (cond ((eq? (cdr label) insts)
                                            (display (car label)))))
                                   labels-list)
                         (display "\n")
                         (display "\n")))
                  (execute)))))
        (define (dispatch message)
          (cond ((eq? message 'start)
                 (set-contents! pc the-instruction-sequence)
                 (execute))
                ((eq? message 'install-instruction-sequence)
                 (lambda (seq) (set! the-instruction-sequence seq)))
                ((eq? message 'allocate-register) allocate-register)
                ((eq? message 'get-register) lookup-register)
                ((eq? message 'install-operations)
                 (lambda (ops) (set! the-ops (append the-ops ops))))
                ((eq? message 'stack) stack)
                ((eq? message 'operations) the-ops)
                ((eq? message 'trace-on)
                 (set! trace-on true))
                ((eq? message 'trace-off)
                 (set! trace-on false))
                ((eq? message 'store-labels)
                 (lambda (labels) (set! labels-list labels)))
                ((eq? message 'get-labels-list)
                 labels-list)
                (else (error "Unknown request -- MACHINE" message))))
        dispatch)))
#+end_src

Example:

#+begin_src racket
  (define fib-machine
    (make-machine
     '(continue n val)
     (list (list '+ +) (list '< <) (list '- -))
     '(
       (assign continue (label fib-done))
       fib-loop
       (test (op <) (reg n) (const 2))
       (branch (label immediate-answer))
       (save continue)
       (assign continue (label afterfib-n-1))
       (save n)
       (assign n (op -) (reg n) (const 1))
       (goto (label fib-loop))
       afterfib-n-1
       (restore n)
       (restore continue)
       (assign n (op -) (reg n) (const 2))
       (save continue)
       (assign continue (label afterfib-n-2))
       (save val)
       (goto (label fib-loop))
       afterfib-n-2
       (assign n (reg val))
       (restore val)
       (restore continue)
       (assign val
               (op +) (reg val) (reg n))
       (goto (reg continue))
       immediate-answer
       (assign val (reg n))
       (goto (reg continue))
       fib-done)))

  (fib-machine 'trace-on)

  (set-register-contents! fib-machine 'n 3)

  (start fib-machine)

  (get-register-contents fib-machine 'val)

  ;; done
  ;; Executing: (assign continue (label fib-done))
  ;; Labels preceding it:

  ;; Executing: (test (op <) (reg n) (const 2))
  ;; Labels preceding it: fib-loop

  ;; Executing: (branch (label immediate-answer))
  ;; Labels preceding it:

  ;; Executing: (save continue)
  ;; Labels preceding it:

  ;; Executing: (assign continue (label afterfib-n-1))
  ;; Labels preceding it:

  ;; Executing: (save n)
  ;; Labels preceding it:

  ;; Executing: (assign n (op -) (reg n) (const 1))
  ;; Labels preceding it:

  ;; Executing: (goto (label fib-loop))
  ;; Labels preceding it:

  ;; Executing: (test (op <) (reg n) (const 2))
  ;; Labels preceding it: fib-loop

  ;; Executing: (branch (label immediate-answer))
  ;; Labels preceding it:

  ;; Executing: (save continue)
  ;; Labels preceding it:

  ;; Executing: (assign continue (label afterfib-n-1))
  ;; Labels preceding it:

  ;; Executing: (save n)
  ;; Labels preceding it:

  ;; Executing: (assign n (op -) (reg n) (const 1))
  ;; Labels preceding it:

  ;; Executing: (goto (label fib-loop))
  ;; Labels preceding it:

  ;; Executing: (test (op <) (reg n) (const 2))
  ;; Labels preceding it: fib-loop

  ;; Executing: (branch (label immediate-answer))
  ;; Labels preceding it:

  ;; Executing: (assign val (reg n))
  ;; Labels preceding it: immediate-answer

  ;; Executing: (goto (reg continue))
  ;; Labels preceding it:

  ;; Executing: (restore n)
  ;; Labels preceding it: afterfib-n-1

  ;; Executing: (restore continue)
  ;; Labels preceding it:

  ;; Executing: (assign n (op -) (reg n) (const 2))
  ;; Labels preceding it:

  ;; Executing: (save continue)
  ;; Labels preceding it:

  ;; Executing: (assign continue (label afterfib-n-2))
  ;; Labels preceding it:

  ;; Executing: (save val)
  ;; Labels preceding it:

  ;; Executing: (goto (label fib-loop))
  ;; Labels preceding it:

  ;; Executing: (test (op <) (reg n) (const 2))
  ;; Labels preceding it: fib-loop

  ;; Executing: (branch (label immediate-answer))
  ;; Labels preceding it:

  ;; Executing: (assign val (reg n))
  ;; Labels preceding it: immediate-answer

  ;; Executing: (goto (reg continue))
  ;; Labels preceding it:

  ;; Executing: (assign n (reg val))
  ;; Labels preceding it: afterfib-n-2

  ;; Executing: (restore val)
  ;; Labels preceding it:

  ;; Executing: (restore continue)
  ;; Labels preceding it:

  ;; Executing: (assign val (op +) (reg val) (reg n))
  ;; Labels preceding it:

  ;; Executing: (goto (reg continue))
  ;; Labels preceding it:

  ;; Executing: (restore n)
  ;; Labels preceding it: afterfib-n-1

  ;; Executing: (restore continue)
  ;; Labels preceding it:

  ;; Executing: (assign n (op -) (reg n) (const 2))
  ;; Labels preceding it:

  ;; Executing: (save continue)
  ;; Labels preceding it:

  ;; Executing: (assign continue (label afterfib-n-2))
  ;; Labels preceding it:

  ;; Executing: (save val)
  ;; Labels preceding it:

  ;; Executing: (goto (label fib-loop))
  ;; Labels preceding it:

  ;; Executing: (test (op <) (reg n) (const 2))
  ;; Labels preceding it: fib-loop

  ;; Executing: (branch (label immediate-answer))
  ;; Labels preceding it:

  ;; Executing: (assign val (reg n))
  ;; Labels preceding it: immediate-answer

  ;; Executing: (goto (reg continue))
  ;; Labels preceding it:

  ;; Executing: (assign n (reg val))
  ;; Labels preceding it: afterfib-n-2

  ;; Executing: (restore val)
  ;; Labels preceding it:

  ;; Executing: (restore continue)
  ;; Labels preceding it:

  ;; Executing: (assign val (op +) (reg val) (reg n))
  ;; Labels preceding it:

  ;; Executing: (goto (reg continue))
  ;; Labels preceding it:

  ;; done
  ;; 2
#+end_src

