blog/40.html
<div id="outline-container-org5ff7765" class="outline-2">
<h2 id="org5ff7765">Exercise 5.17</h2>
<div class="outline-text-2" id="text-org5ff7765">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Extend the instruction tracing of Exercise 5.16 so that before
printing an instruction, the simulator prints any labels that
immediately precede that instruction in the controller sequence.  Be
careful to do this in a way that does not interfere with instruction
counting (Exercise 5.15).  You will have to make the simulator retain
the necessary label information.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I've modified the machine and the assembler so that the latter stores
the list of labels in the former. (Remember that a label is pair whose
car is the label name and whose cdr is a list of instructions).
</p>

<p>
Now, when we print the instruction text, we additionally check whether
such instruction is the cdr of one or more of the labels in the labels
list.
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assemble</span> controller-text machine)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">result</span> (extract-labels controller-text)))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (<span style="color: #8f0075;">car</span> result)) (<span style="color: #005e8b;">labels</span> (<span style="color: #8f0075;">cdr</span> result)))
      (update-insts! insts labels machine)
      ((machine <span style="color: #0000b0;">'store-labels</span>) labels)
      insts)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">labels-list</span> '())
        (<span style="color: #005e8b;">trace-on</span> <span style="color: #8f0075;">false</span>))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (<span style="color: #531ab6;">and</span> trace-on
                     (<span style="color: #531ab6;">begin</span>
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"Executing: "</span>)
                       (<span style="color: #8f0075;">display</span> (instruction-text (<span style="color: #8f0075;">car</span> insts)))
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"Labels preceding it: "</span>)
                       (<span style="color: #8f0075;">for-each</span> (<span style="color: #531ab6;">lambda</span> (label)
                                   (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> (<span style="color: #8f0075;">cdr</span> label) insts)
                                          (<span style="color: #8f0075;">display</span> (<span style="color: #8f0075;">car</span> label)))))
                                 labels-list)
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)
                       (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'trace-on</span>)
               (<span style="color: #531ab6;">set!</span> trace-on <span style="color: #8f0075;">true</span>))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'trace-off</span>)
               (<span style="color: #531ab6;">set!</span> trace-on <span style="color: #8f0075;">false</span>))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'store-labels</span>)
               (<span style="color: #531ab6;">lambda</span> (labels) (<span style="color: #531ab6;">set!</span> labels-list labels)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-labels-list</span>)
               labels-list)
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">fib-machine</span>
  (make-machine
   '(continue n val)
   (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'+</span> <span style="color: #8f0075;">+</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'&lt;</span> <span style="color: #8f0075;">&lt;</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'-</span> <span style="color: #8f0075;">-</span>))
   '(
     (assign continue (label fib-done))
     fib-loop
     (test (op <span style="color: #8f0075;">&lt;</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (branch (label immediate-answer))
     (save continue)
     (assign continue (label afterfib-n-1))
     (save n)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">1</span>))
     (goto (label fib-loop))
     afterfib-n-1
     (restore n)
     (restore continue)
     (assign n (op <span style="color: #8f0075;">-</span>) (reg n) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">2</span>))
     (save continue)
     (assign continue (label afterfib-n-2))
     (save val)
     (goto (label fib-loop))
     afterfib-n-2
     (assign n (reg val))
     (restore val)
     (restore continue)
     (assign val
             (op <span style="color: #8f0075;">+</span>) (reg val) (reg n))
     (goto (reg continue))
     immediate-answer
     (assign val (reg n))
     (goto (reg continue))
     fib-done)))

(fib-machine <span style="color: #0000b0;">'trace-on</span>)

(set-register-contents! fib-machine <span style="color: #0000b0;">'n</span> <span style="color: #0000b0;">3</span>)

(start fib-machine)

(get-register-contents fib-machine <span style="color: #0000b0;">'val</span>)

<span style="color: #595959;">;; </span><span style="color: #595959;">done</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign continue (label fib-done))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (test (op &lt;) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: fib-loop</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (branch (label immediate-answer))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign continue (label afterfib-n-1))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save n)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (op -) (reg n) (const 1))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (label fib-loop))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (test (op &lt;) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: fib-loop</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (branch (label immediate-answer))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign continue (label afterfib-n-1))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save n)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (op -) (reg n) (const 1))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (label fib-loop))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (test (op &lt;) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: fib-loop</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (branch (label immediate-answer))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign val (reg n))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: immediate-answer</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (reg continue))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore n)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: afterfib-n-1</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (op -) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign continue (label afterfib-n-2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save val)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (label fib-loop))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (test (op &lt;) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: fib-loop</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (branch (label immediate-answer))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign val (reg n))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: immediate-answer</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (reg continue))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (reg val))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: afterfib-n-2</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore val)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign val (op +) (reg val) (reg n))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (reg continue))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore n)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: afterfib-n-1</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (op -) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign continue (label afterfib-n-2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (save val)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (label fib-loop))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (test (op &lt;) (reg n) (const 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: fib-loop</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (branch (label immediate-answer))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign val (reg n))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: immediate-answer</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (reg continue))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign n (reg val))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it: afterfib-n-2</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore val)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (restore continue)</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (assign val (op +) (reg val) (reg n))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Executing: (goto (reg continue))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">Labels preceding it:</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">done</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">2</span>
</pre>
</div>
</div>
</div>
