blog/40.org
** Exercise 5.18
*Exercise*:

#+begin_quote
Modify the `make-register' procedure of section 5-2-1 so that
registers can be traced.  Registers should accept messages that turn
tracing on and off.  When a register is traced, assigning a value to
the register should print the name of the register, the old contents
of the register, and the new contents being assigned.  Extend the
interface to the machine model to permit you to turn tracing on and
off for designated machine registers.
#+end_quote

*Answer*:

#+begin_src racket
  (define (make-register name)
    (let ((contents '*unassigned*)
          (tracer 'off))
      (define (dispatch message)
        (cond ((eq? message 'get) contents)
              ((eq? message 'set)
               (lambda (value)
                 (and (eq? tracer 'on)
                      (begin
                        (display "setting value of ")(display name)(display "\n")
                        (display "old value: ")(display contents)(display "\n")
                        (display "new value: ")(display value)(display "\n")
                        (display "\n")))
                 (set! contents value)))
              ((eq? message 'tracer-on)
               (set! tracer 'on))
              ((eq? message 'tracer-off)
               (set! tracer 'off))
              (else
               (error "Unknown request -- REGISTER" message))))
      dispatch))

  (define (make-new-machine)
    (let ((pc (make-register 'pc))
          (flag (make-register 'flag))
          (stack (make-stack))
          (the-instruction-sequence '()))
      (let ((the-ops
             (list (list 'initialize-stack
                         (lambda () (stack 'initialize)))))
            (register-table
             (list (list 'pc pc) (list 'flag flag))))
        (define (allocate-register name)
          (if (assoc name register-table)
              (error "Multiply defined register: " name)
              (set! register-table
                    (cons (list name (make-register name))
                          register-table)))
          'register-allocated)
        (define (lookup-register name)
          (let ((val (assoc name register-table)))
            (if val
                (cadr val)
                (error "Unknown register:" name))))
        (define (execute)
          (let ((insts (get-contents pc)))
            (if (null? insts)
                'done
                (begin
                  ((instruction-execution-proc (car insts)))
                  (execute)))))
        (define (dispatch message)
          (cond ((eq? message 'start)
                 (set-contents! pc the-instruction-sequence)
                 (execute))
                ((eq? message 'install-instruction-sequence)
                 (lambda (seq) (set! the-instruction-sequence seq)))
                ((eq? message 'allocate-register) allocate-register)
                ((eq? message 'get-register) lookup-register)
                ((eq? message 'install-operations)
                 (lambda (ops) (set! the-ops (append the-ops ops))))
                ((eq? message 'stack) stack)
                ((eq? message 'operations) the-ops)
                ((eq? message 'set-reg-tracer-on)
                 (lambda (name)
                   (let ((reg (lookup-register name)))
                     (reg 'tracer-on))))
                ((eq? message 'set-reg-tracer-off)
                 (lambda (name)
                   (let ((reg (lookup-register name)))
                     (reg 'tracer-off))))
                (else (error "Unknown request -- MACHINE" message))))
        dispatch)))
#+end_src

Usage example:
#+begin_src racket
  (define gcd-machine
    (make-machine
     '(a b t)
     (list (list 'rem remainder) (list '= =))
     '(test-b
       (test (op =) (reg b) (const 0))
       (branch (label gcd-done))
       (assign t (op rem) (reg a) (reg b))
       (assign a (reg b))
       (assign b (reg t))
       (goto (label test-b))
       gcd-done)))


  ((gcd-machine 'set-reg-tracer-on) 'b)

  (set-register-contents! gcd-machine 'a 206)
  (set-register-contents! gcd-machine 'b 40)
  (start gcd-machine) ;; => done
  (get-register-contents gcd-machine 'a)

  ;; done
  ;; setting value of b
  ;; old value: *unassigned*
  ;; new value: 40

  ;; done
  ;; setting value of b
  ;; old value: 40
  ;; new value: 6

  ;; setting value of b
  ;; old value: 6
  ;; new value: 4

  ;; setting value of b
  ;; old value: 4
  ;; new value: 2

  ;; setting value of b
  ;; old value: 2
  ;; new value: 0

  ;; done
  ;; 2
#+end_src

