blog/40.html
<div id="outline-container-org0aca9ba" class="outline-2">
<h2 id="org0aca9ba">Exercise 5.18</h2>
<div class="outline-text-2" id="text-org0aca9ba">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the `make-register' procedure of section 5-2-1 so that
registers can be traced.  Registers should accept messages that turn
tracing on and off.  When a register is traced, assigning a value to
the register should print the name of the register, the old contents
of the register, and the new contents being assigned.  Extend the
interface to the machine model to permit you to turn tracing on and
off for designated machine registers.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-register</span> name)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">contents</span> <span style="color: #0000b0;">'*unassigned*</span>)
        (<span style="color: #005e8b;">tracer</span> <span style="color: #0000b0;">'off</span>))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
      (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get</span>) contents)
            ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'set</span>)
             (<span style="color: #531ab6;">lambda</span> (value)
               (<span style="color: #531ab6;">and</span> (<span style="color: #8f0075;">eq?</span> tracer <span style="color: #0000b0;">'on</span>)
                    (<span style="color: #531ab6;">begin</span>
                      (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"setting value of "</span>)(<span style="color: #8f0075;">display</span> name)(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)
                      (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"old value: "</span>)(<span style="color: #8f0075;">display</span> contents)(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)
                      (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"new value: "</span>)(<span style="color: #8f0075;">display</span> value)(<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)
                      (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>)))
               (<span style="color: #531ab6;">set!</span> contents value)))
            ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'tracer-on</span>)
             (<span style="color: #531ab6;">set!</span> tracer <span style="color: #0000b0;">'on</span>))
            ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'tracer-off</span>)
             (<span style="color: #531ab6;">set!</span> tracer <span style="color: #0000b0;">'off</span>))
            (<span style="color: #531ab6;">else</span>
             (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- REGISTER"</span> message))))
    dispatch))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '()))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span>)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">begin</span>
                ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                (execute)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'set-reg-tracer-on</span>)
               (<span style="color: #531ab6;">lambda</span> (name)
                 (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">reg</span> (lookup-register name)))
                   (reg <span style="color: #0000b0;">'tracer-on</span>))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'set-reg-tracer-off</span>)
               (<span style="color: #531ab6;">lambda</span> (name)
                 (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">reg</span> (lookup-register name)))
                   (reg <span style="color: #0000b0;">'tracer-off</span>))))
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))
</pre>
</div>

<p>
Usage example:
</p>
<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> <span style="color: #005e8b;">gcd-machine</span>
  (make-machine
   '(a b t)
   (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'rem</span> <span style="color: #8f0075;">remainder</span>) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'=</span> <span style="color: #8f0075;">=</span>))
   '(test-b
     (test (op <span style="color: #8f0075;">=</span>) (reg b) (<span style="color: #8f0075;">const</span> <span style="color: #0000b0;">0</span>))
     (branch (label gcd-done))
     (assign t (op rem) (reg a) (reg b))
     (assign a (reg b))
     (assign b (reg t))
     (goto (label test-b))
     gcd-done)))


((gcd-machine <span style="color: #0000b0;">'set-reg-tracer-on</span>) <span style="color: #0000b0;">'b</span>)

(set-register-contents! gcd-machine <span style="color: #0000b0;">'a</span> <span style="color: #0000b0;">206</span>)
(set-register-contents! gcd-machine <span style="color: #0000b0;">'b</span> <span style="color: #0000b0;">40</span>)
(start gcd-machine) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; done</span>
(get-register-contents gcd-machine <span style="color: #0000b0;">'a</span>)

<span style="color: #595959;">;; </span><span style="color: #595959;">done</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">setting value of b</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">old value: *unassigned*</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">new value: 40</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">done</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">setting value of b</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">old value: 40</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">new value: 6</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">setting value of b</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">old value: 6</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">new value: 4</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">setting value of b</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">old value: 4</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">new value: 2</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">setting value of b</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">old value: 2</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">new value: 0</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">done</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">2</span>
</pre>
</div>
</div>
</div>
