blog/40.org
** Exercise 5.19
*Exercise*:

#+begin_quote
Alyssa P. Hacker wants a "breakpoint" feature in the simulator to help
her debug her machine designs.  You have been hired to install this
feature for her.  She wants to be able to specify a place in the
controller sequence where the simulator will stop and allow her to
examine the state of the machine.  You are to implement a procedure

#+begin_src scheme
  (set-breakpoint <MACHINE> <LABEL> <N>)
#+end_src

that sets a breakpoint just before the nth instruction after the
given label.  For example,

#+begin_src scheme
  (set-breakpoint gcd-machine 'test-b 4)
#+end_src

installs a breakpoint in `gcd-machine' just before the assignment
to register `a'.  When the simulator reaches the breakpoint it
should print the label and the offset of the breakpoint and stop
executing instructions.  Alyssa can then use
`get-register-contents' and `set-register-contents!' to manipulate
the state of the simulated machine.  She should then be able to
continue execution by saying

#+begin_src scheme
  (proceed-machine <MACHINE>)
#+end_src

She should also be able to remove a specific breakpoint by means of

#+begin_src scheme
  (cancel-breakpoint <MACHINE> <LABEL> <N>)
#+end_src

or to remove all breakpoints by means of

#+begin_src scheme
  (cancel-all-breakpoints <MACHINE>)
#+end_src
#+end_quote

*Answer*:

- I'm implementing breakpoints by changing the representation of
  instructions:
  - previously an element in the instruction sequence was represented
    as: ~( instruction-text . <procedure> )~;
  - now: ~( ( instruction-text . <procedure> ). <BREAKPOINT-INFO> )~.

    The ~<BREAKPOINT-INFO>~ tells us whether there is a breakpoint
    there. It can either be ~false~, which means there is no
    breakpoint, or a pair whose car and cdr are, respectively, the
    label and offset used by the user to set the breakpoint.

- ~execute~ now takes boolean;
  - if we pass ~false~, ~execute~ will stop if the next instruction to
    execute has a breakpoint;
  - if we pass ~true~, ~execute~ will set the breakpoint of the next
    instruction to execute to ~false~, and continue execution;
  - Accordingly:
    - ~starts~ applies ~execute~ to ~false~;
    - ~proceed-machine~ applies ~execute~ to ~true~.

- I'm storing the labels in the machine as I did in Exercise
  5.17. This facilitates the implementation of ~set-breakpoint~ and
  ~cancel-breakpoint~.

Added/modified code:

#+begin_src racket
  (define (make-new-machine)
    (let ((pc (make-register 'pc))
          (flag (make-register 'flag))
          (stack (make-stack))
          (the-instruction-sequence '())
          (labels-list '()))
      (let ((the-ops
             (list (list 'initialize-stack
                         (lambda () (stack 'initialize)))))
            (register-table
             (list (list 'pc pc) (list 'flag flag))))
        (define (allocate-register name)
          (if (assoc name register-table)
              (error "Multiply defined register: " name)
              (set! register-table
                    (cons (list name (make-register name))
                          register-table)))
          'register-allocated)
        (define (lookup-register name)
          (let ((val (assoc name register-table)))
            (if val
                (cadr val)
                (error "Unknown register:" name))))
        (define (execute force) ;; force is used to unset a breakpoint and continue
          (let ((insts (get-contents pc)))
            (if (null? insts)
                'done
                (cond (force
                       (set-cdr! (car insts) false) ;; unset breakpoint
                       ((instruction-execution-proc (car insts)))
                       (execute false))
                      ((cdr (car insts))
                       (display "stopped at a breakpoint!\n")
                       (display (cdr (car insts)))
                       (display "\n"))
                      (else
                       ((instruction-execution-proc (car insts)))
                       (execute false))))))
        (define (set-breakpoint label-name n)
          (let ((insts (lookup-label labels-list label-name)))
            (let ((inst (list-ref2 insts n)))
              (set-cdr! inst (cons label-name n)))))
        (define (cancel-breakpoint label-name n)
          (let ((insts (lookup-label labels-list label-name)))
            (let ((inst (list-ref2 insts n)))
              (set-cdr! inst false))))
        (define (cancel-all-breakpoints insts)
          (if (null? insts)
              'done
              (begin
                (set-cdr! (car insts) false) ;; unset breakpoint
                (cancel-all-breakpoints (cdr insts)))))
        (define (dispatch message)
          (cond ((eq? message 'start)
                 (set-contents! pc the-instruction-sequence)
                 (execute false))
                ((eq? message 'install-instruction-sequence)
                 (lambda (seq) (set! the-instruction-sequence seq)))
                ((eq? message 'allocate-register) allocate-register)
                ((eq? message 'get-register) lookup-register)
                ((eq? message 'install-operations)
                 (lambda (ops) (set! the-ops (append the-ops ops))))
                ((eq? message 'stack) stack)
                ((eq? message 'operations) the-ops)
                ((eq? message 'store-labels)
                 (lambda (labels) (set! labels-list labels)))
                ((eq? message 'set-breakpoint)
                 set-breakpoint)
                ((eq? message 'cancel-breakpoint)
                 cancel-breakpoint)
                ((eq? message 'cancel-all-breakpoints)
                 (cancel-all-breakpoints the-instruction-sequence))
                ((eq? message 'proceed-machine)
                 (execute true))
                ((eq? message 'get-labels)
                 labels-list)
                ((eq? message 'get-insts)
                 the-instruction-sequence)
                (else (error "Unknown request -- MACHINE" message))))
        dispatch)))

  ;; a modified version of list-ref in the book
  (define (list-ref2 items n)
    (cond ((null? items)
           '())
          ((= n 0)
           (car items))
          (else
           (list-ref (cdr items) (- n 1)))))

  (define (set-breakpoint machine label n)
    ((machine 'set-breakpoint) label n))

  (define (proceed-machine machine)
    (machine 'proceed-machine))

  (define (cancel-breakpoint machine label n)
    ((machine 'cancel-breakpoint) label n))

  (define (cancel-all-breakpoints machine)
    (machine 'cancel-all-breakpoints))

  (define (assemble controller-text machine)
    (let ((result (extract-labels controller-text)))
      (let ((insts (car result)) (labels (cdr result)))
        (update-insts! insts labels machine)
        ((machine 'store-labels) labels)
        insts)))

  (define (make-instruction text)
    (cons (cons text '()) false))

  (define (instruction-text inst)
    (caar inst))

  (define (instruction-execution-proc inst)
    (cdar inst))

  (define (set-instruction-execution-proc! inst proc)
    (set-cdr! (car inst) proc))
#+end_src
