blog/40.html
<div id="outline-container-org448ef36" class="outline-2">
<h2 id="org448ef36">Exercise 5.19</h2>
<div class="outline-text-2" id="text-org448ef36">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Alyssa P. Hacker wants a "breakpoint" feature in the simulator to help
her debug her machine designs.  You have been hired to install this
feature for her.  She wants to be able to specify a place in the
controller sequence where the simulator will stop and allow her to
examine the state of the machine.  You are to implement a procedure
</p>

<div class="org-src-container">
<pre class="src src-scheme">(set-breakpoint <span style="color: #005f5f;">&lt;MACHINE&gt;</span> <span style="color: #005f5f;">&lt;LABEL&gt;</span> <span style="color: #005f5f;">&lt;N&gt;</span>)
</pre>
</div>

<p>
that sets a breakpoint just before the nth instruction after the
given label.  For example,
</p>

<div class="org-src-container">
<pre class="src src-scheme">(set-breakpoint gcd-machine 'test-b 4)
</pre>
</div>

<p>
installs a breakpoint in `gcd-machine' just before the assignment
to register `a'.  When the simulator reaches the breakpoint it
should print the label and the offset of the breakpoint and stop
executing instructions.  Alyssa can then use
`get-register-contents' and `set-register-contents!' to manipulate
the state of the simulated machine.  She should then be able to
continue execution by saying
</p>

<div class="org-src-container">
<pre class="src src-scheme">(proceed-machine <span style="color: #005f5f;">&lt;MACHINE&gt;</span>)
</pre>
</div>

<p>
She should also be able to remove a specific breakpoint by means of
</p>

<div class="org-src-container">
<pre class="src src-scheme">(cancel-breakpoint <span style="color: #005f5f;">&lt;MACHINE&gt;</span> <span style="color: #005f5f;">&lt;LABEL&gt;</span> <span style="color: #005f5f;">&lt;N&gt;</span>)
</pre>
</div>

<p>
or to remove all breakpoints by means of
</p>

<div class="org-src-container">
<pre class="src src-scheme">(cancel-all-breakpoints <span style="color: #005f5f;">&lt;MACHINE&gt;</span>)
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li>I'm implementing breakpoints by changing the representation of
instructions:
<ul class="org-ul">
<li>previously an element in the instruction sequence was represented
as: <code>( instruction-text . &lt;procedure&gt; )</code>;</li>
<li><p>
now: <code>( ( instruction-text . &lt;procedure&gt; ). &lt;BREAKPOINT-INFO&gt; )</code>.
</p>

<p>
The <code>&lt;BREAKPOINT-INFO&gt;</code> tells us whether there is a breakpoint
there. It can either be <code>false</code>, which means there is no
breakpoint, or a pair whose car and cdr are, respectively, the
label and offset used by the user to set the breakpoint.
</p></li>
</ul></li>

<li><code>execute</code> now takes boolean;
<ul class="org-ul">
<li>if we pass <code>false</code>, <code>execute</code> will stop if the next instruction to
execute has a breakpoint;</li>
<li>if we pass <code>true</code>, <code>execute</code> will set the breakpoint of the next
instruction to execute to <code>false</code>, and continue execution;</li>
<li>Accordingly:
<ul class="org-ul">
<li><code>starts</code> applies <code>execute</code> to <code>false</code>;</li>
<li><code>proceed-machine</code> applies <code>execute</code> to <code>true</code>.</li>
</ul></li>
</ul></li>

<li>I'm storing the labels in the machine as I did in Exercise
5.17. This facilitates the implementation of <code>set-breakpoint</code> and
<code>cancel-breakpoint</code>.</li>
</ul>

<p>
Added/modified code:
</p>

<div class="org-src-container">
<pre class="src src-racket">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-new-machine</span>)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">pc</span> (make-register <span style="color: #0000b0;">'pc</span>))
        (<span style="color: #005e8b;">flag</span> (make-register <span style="color: #0000b0;">'flag</span>))
        (<span style="color: #005e8b;">stack</span> (make-stack))
        (<span style="color: #005e8b;">the-instruction-sequence</span> '())
        (<span style="color: #005e8b;">labels-list</span> '()))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">the-ops</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'initialize-stack</span>
                       (<span style="color: #531ab6;">lambda</span> () (stack <span style="color: #0000b0;">'initialize</span>)))))
          (<span style="color: #005e8b;">register-table</span>
           (<span style="color: #8f0075;">list</span> (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'pc</span> pc) (<span style="color: #8f0075;">list</span> <span style="color: #0000b0;">'flag</span> flag))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">allocate-register</span> name)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">assoc</span> name register-table)
            (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Multiply defined register: "</span> name)
            (<span style="color: #531ab6;">set!</span> register-table
                  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">list</span> name (make-register name))
                        register-table)))
        <span style="color: #0000b0;">'register-allocated</span>)
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-register</span> name)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">val</span> (<span style="color: #8f0075;">assoc</span> name register-table)))
          (<span style="color: #531ab6;">if</span> val
              (<span style="color: #8f0075;">cadr</span> val)
              (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown register:"</span> name))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">execute</span> <span style="color: #8f0075;">force</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">force is used to unset a breakpoint and continue</span>
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (get-contents pc)))
          (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
              <span style="color: #0000b0;">'done</span>
              (<span style="color: #531ab6;">cond</span> (<span style="color: #8f0075;">force</span>
                     (set-cdr! (<span style="color: #8f0075;">car</span> insts) <span style="color: #8f0075;">false</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">unset breakpoint</span>
                     ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                     (execute <span style="color: #8f0075;">false</span>))
                    ((<span style="color: #8f0075;">cdr</span> (<span style="color: #8f0075;">car</span> insts))
                     (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"stopped at a breakpoint!\n"</span>)
                     (<span style="color: #8f0075;">display</span> (<span style="color: #8f0075;">cdr</span> (<span style="color: #8f0075;">car</span> insts)))
                     (<span style="color: #8f0075;">display</span> <span style="color: #3548cf;">"\n"</span>))
                    (<span style="color: #531ab6;">else</span>
                     ((instruction-execution-proc (<span style="color: #8f0075;">car</span> insts)))
                     (execute <span style="color: #8f0075;">false</span>))))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-breakpoint</span> label-name n)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (lookup-label labels-list label-name)))
          (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">inst</span> (list-ref2 insts n)))
            (set-cdr! <span style="color: #8f0075;">inst</span> (<span style="color: #8f0075;">cons</span> label-name n)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cancel-breakpoint</span> label-name n)
        (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (lookup-label labels-list label-name)))
          (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">inst</span> (list-ref2 insts n)))
            (set-cdr! <span style="color: #8f0075;">inst</span> <span style="color: #8f0075;">false</span>))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cancel-all-breakpoints</span> insts)
        (<span style="color: #531ab6;">if</span> (<span style="color: #8f0075;">null?</span> insts)
            <span style="color: #0000b0;">'done</span>
            (<span style="color: #531ab6;">begin</span>
              (set-cdr! (<span style="color: #8f0075;">car</span> insts) <span style="color: #8f0075;">false</span>) <span style="color: #595959;">;; </span><span style="color: #595959;">unset breakpoint</span>
              (cancel-all-breakpoints (<span style="color: #8f0075;">cdr</span> insts)))))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> message)
        (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'start</span>)
               (set-contents! pc the-instruction-sequence)
               (execute <span style="color: #8f0075;">false</span>))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-instruction-sequence</span>)
               (<span style="color: #531ab6;">lambda</span> (seq) (<span style="color: #531ab6;">set!</span> the-instruction-sequence seq)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'allocate-register</span>) allocate-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-register</span>) lookup-register)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'install-operations</span>)
               (<span style="color: #531ab6;">lambda</span> (ops) (<span style="color: #531ab6;">set!</span> the-ops (<span style="color: #8f0075;">append</span> the-ops ops))))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'stack</span>) stack)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'operations</span>) the-ops)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'store-labels</span>)
               (<span style="color: #531ab6;">lambda</span> (labels) (<span style="color: #531ab6;">set!</span> labels-list labels)))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'set-breakpoint</span>)
               set-breakpoint)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'cancel-breakpoint</span>)
               cancel-breakpoint)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'cancel-all-breakpoints</span>)
               (cancel-all-breakpoints the-instruction-sequence))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'proceed-machine</span>)
               (execute <span style="color: #8f0075;">true</span>))
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-labels</span>)
               labels-list)
              ((<span style="color: #8f0075;">eq?</span> message <span style="color: #0000b0;">'get-insts</span>)
               the-instruction-sequence)
              (<span style="color: #531ab6;">else</span> (<span style="color: #8f0075;">error</span> <span style="color: #3548cf;">"Unknown request -- MACHINE"</span> message))))
      dispatch)))

<span style="color: #595959;">;; </span><span style="color: #595959;">a modified version of list-ref in the book</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-ref2</span> items n)
  (<span style="color: #531ab6;">cond</span> ((<span style="color: #8f0075;">null?</span> items)
         '())
        ((<span style="color: #8f0075;">=</span> n <span style="color: #0000b0;">0</span>)
         (<span style="color: #8f0075;">car</span> items))
        (<span style="color: #531ab6;">else</span>
         (<span style="color: #8f0075;">list-ref</span> (<span style="color: #8f0075;">cdr</span> items) (<span style="color: #8f0075;">-</span> n <span style="color: #0000b0;">1</span>)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-breakpoint</span> machine label n)
  ((machine <span style="color: #0000b0;">'set-breakpoint</span>) label n))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">proceed-machine</span> machine)
  (machine <span style="color: #0000b0;">'proceed-machine</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cancel-breakpoint</span> machine label n)
  ((machine <span style="color: #0000b0;">'cancel-breakpoint</span>) label n))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cancel-all-breakpoints</span> machine)
  (machine <span style="color: #0000b0;">'cancel-all-breakpoints</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assemble</span> controller-text machine)
  (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">result</span> (extract-labels controller-text)))
    (<span style="color: #531ab6;">let</span> ((<span style="color: #005e8b;">insts</span> (<span style="color: #8f0075;">car</span> result)) (<span style="color: #005e8b;">labels</span> (<span style="color: #8f0075;">cdr</span> result)))
      (update-insts! insts labels machine)
      ((machine <span style="color: #0000b0;">'store-labels</span>) labels)
      insts)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-instruction</span> text)
  (<span style="color: #8f0075;">cons</span> (<span style="color: #8f0075;">cons</span> text '()) <span style="color: #8f0075;">false</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">instruction-text</span> <span style="color: #8f0075;">inst</span>)
  (<span style="color: #8f0075;">caar</span> <span style="color: #8f0075;">inst</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">instruction-execution-proc</span> <span style="color: #8f0075;">inst</span>)
  (<span style="color: #8f0075;">cdar</span> <span style="color: #8f0075;">inst</span>))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-instruction-execution-proc!</span> <span style="color: #8f0075;">inst</span> proc)
  (set-cdr! (<span style="color: #8f0075;">car</span> <span style="color: #8f0075;">inst</span>) proc))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html"></a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span></p>
</div>
</body>
</html>
